app/Controllers/AdminSekolah.php

SELECT `sekolah`.*, `personil_sekolah`.`perencana`, `personil_sekolah`.`hp_perencana`, `personil_sekolah`.`pengawas`, `personil_sekolah`.`hp_pengawas`, `perencana`.`nama_lengkap` AS `nama_perencana_user`, `perencana`.`nik` AS `nik_perencana_user`, `perencana`.`nip` AS `nip_perencana_user`, `pengawas`.`nama_lengkap` AS `nama_pengawas_user`, `pengawas`.`nik` AS `nik_pengawas_user`, `pengawas`.`nip` AS `nip_pengawas_user`
FROM `sekolah`
LEFT JOIN `users` `perencana` ON `perencana`.`id` = `sekolah`.`perencana_id`
LEFT JOIN `users` `pengawas` ON `pengawas`.`id` = `sekolah`.`pengawas_id`
LEFT JOIN `personil_sekolah` ON `personil_sekolah`.`sekolah_id` = `sekolah`.`id`
ORDER BY `sekolah`.`nama_sekolah` ASC
SELECT *
FROM `bantuan_sekolah`
ORDER BY `nama_bantuan` ASC
SELECT `id`, `nama_lengkap`, `nik`, `nip`, `no_hp`, `email`
FROM `users`
WHERE `role` = 'perencana'
ORDER BY `nama_lengkap` ASC
SELECT `id`, `nama_lengkap`, `nik`, `nip`, `no_hp`, `email`
FROM `users`
WHERE `role` = 'pengawas'
ORDER BY `nama_lengkap` ASC
---
    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Halaman ini hanya dapat diakses admin.');
        }

        $schools = Database::connect()->table('sekolah')
            ->select('sekolah.*, personil_sekolah.perencana, personil_sekolah.hp_perencana, personil_sekolah.pengawas, personil_sekolah.hp_pengawas, perencana.nama_lengkap AS nama_perencana_user, perencana.nik AS nik_perencana_user, perencana.nip AS nip_perencana_user, pengawas.nama_lengkap AS nama_pengawas_user, pengawas.nik AS nik_pengawas_user, pengawas.nip AS nip_pengawas_user')
            ->join('users perencana', 'perencana.id = sekolah.perencana_id', 'left')
            ->join('users pengawas', 'pengawas.id = sekolah.pengawas_id', 'left')
            ->join('personil_sekolah', 'personil_sekolah.sekolah_id = sekolah.id', 'left')
            ->orderBy('sekolah.nama_sekolah', 'ASC')
            ->get()
            ->getResultArray();
        $assistanceRows = Database::connect()->table('bantuan_sekolah')
            ->orderBy('nama_bantuan', 'ASC')
            ->get()
            ->getResultArray();
        $assistanceBySchool = [];
        foreach ($assistanceRows as $assistance) {
            $assistanceBySchool[$assistance['sekolah_id']][] = $assistance['nama_bantuan'];
        }

        $perencana = Database::connect()->table('users')->select('id, nama_lengkap, nik, nip, no_hp, email')->where('role', 'perencana')->orderBy('nama_lengkap', 'ASC')->get()->getResultArray();
        $pengawas = Database::connect()->table('users')->select('id, nama_lengkap, nik, nip, no_hp, email')->where('role', 'pengawas')->orderBy('nama_lengkap', 'ASC')->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `id` = 1
SELECT COUNT(*) AS `numrows`
FROM `bantuan_sekolah`
WHERE `sekolah_id` = 1
AND `nama_bantuan` = 'tes'
---
    public function storeBantuan(int $schoolId)
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Hanya admin yang dapat mengelola jenis bantuan.');
        }

        $name = trim((string) $this->request->getPost('nama_bantuan'));
        if ($name === '' || mb_strlen($name) > 150) {
            return redirect()->back()->withInput()->with('error', 'Jenis bantuan wajib diisi dan maksimal 150 karakter.');
        }
        $volume = trim((string) $this->request->getPost('volume'));
        if (preg_match('/^\d{1,10}(?:\.\d{1,2})?$/D', $volume) !== 1 || (float) $volume <= 0) {
            return redirect()->back()->withInput()->with('error', 'Volume harus lebih besar dari 0 dan maksimal dua angka desimal.');
        }
        $volumeUnit = trim((string) $this->request->getPost('satuan_volume'));
        if ($volumeUnit === '' || mb_strlen($volumeUnit) > 30) {
            return redirect()->back()->withInput()->with('error', 'Satuan volume wajib diisi dan maksimal 30 karakter.');
        }

        $db = Database::connect();
        if ($db->table('sekolah')->where('id', $schoolId)->countAllResults() === 0) {
            return redirect()->to('/admin/sekolah')->with('error', 'Sekolah tidak ditemukan.');
        }

        $duplicate = $db->table('bantuan_sekolah')
            ->where('sekolah_id', $schoolId)
            ->where('nama_bantuan', $name)
            ->countAllResults();

INSERT INTO `bantuan_sekolah` (`sekolah_id`, `nama_bantuan`, `volume`, `satuan_volume`) VALUES (1, 'tes', '1.00', 'Ls')
---
            return redirect()->to("/admin/sekolah/$schoolId")->with('error', 'Jenis bantuan tersebut sudah terdaftar untuk sekolah ini.');
        }

        $db->table('bantuan_sekolah')->insert([
            'sekolah_id'  => $schoolId,
            'nama_bantuan' => $name,
            'volume' => number_format((float) $volume, 2, '.', ''),
            'satuan_volume' => $volumeUnit,
        ]);

SELECT `sekolah`.*, `personil_sekolah`.`perencana`, `personil_sekolah`.`pengawas`, `personil_sekolah`.`kepala_sekolah`, `perencana`.`nama_lengkap` AS `nama_perencana_user`, `perencana`.`nik` AS `nik_perencana_user`, `perencana`.`nip` AS `nip_perencana_user`, `pengawas`.`nama_lengkap` AS `nama_pengawas_user`, `pengawas`.`nik` AS `nik_pengawas_user`, `pengawas`.`nip` AS `nip_pengawas_user`
FROM `sekolah`
LEFT JOIN `users` `perencana` ON `perencana`.`id` = `sekolah`.`perencana_id`
LEFT JOIN `users` `pengawas` ON `pengawas`.`id` = `sekolah`.`pengawas_id`
LEFT JOIN `personil_sekolah` ON `personil_sekolah`.`sekolah_id` = `sekolah`.`id`
WHERE `sekolah`.`id` = 1
SELECT *
FROM `bantuan_sekolah`
WHERE `sekolah_id` = 1
ORDER BY `nama_bantuan` ASC
SELECT `id`, `nama_lengkap`, `nik`, `nip`, `no_hp`, `email`
FROM `users`
WHERE `role` = 'perencana'
ORDER BY `nama_lengkap` ASC
SELECT `id`, `nama_lengkap`, `nik`, `nip`, `no_hp`, `email`
FROM `users`
WHERE `role` = 'pengawas'
ORDER BY `nama_lengkap` ASC
---
    public function detail(int $schoolId)
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Halaman ini hanya dapat diakses admin.');
        }

        $db = Database::connect();
        $school = $db->table('sekolah')
            ->select('sekolah.*, personil_sekolah.perencana, personil_sekolah.pengawas, personil_sekolah.kepala_sekolah, perencana.nama_lengkap AS nama_perencana_user, perencana.nik AS nik_perencana_user, perencana.nip AS nip_perencana_user, pengawas.nama_lengkap AS nama_pengawas_user, pengawas.nik AS nik_pengawas_user, pengawas.nip AS nip_pengawas_user')
            ->join('users perencana', 'perencana.id = sekolah.perencana_id', 'left')
            ->join('users pengawas', 'pengawas.id = sekolah.pengawas_id', 'left')
            ->join('personil_sekolah', 'personil_sekolah.sekolah_id = sekolah.id', 'left')
            ->where('sekolah.id', $schoolId)
            ->get()
            ->getRowArray();
        if (!$school) {
            return redirect()->to('/admin/sekolah')->with('error', 'Sekolah tidak ditemukan.');
        }

        $assistance = $db->table('bantuan_sekolah')
            ->where('sekolah_id', $schoolId)
            ->orderBy('nama_bantuan', 'ASC')
            ->get()
            ->getResultArray();

        $perencana = $db->table('users')->select('id, nama_lengkap, nik, nip, no_hp, email')->where('role', 'perencana')->orderBy('nama_lengkap', 'ASC')->get()->getResultArray();
        $pengawas = $db->table('users')->select('id, nama_lengkap, nik, nip, no_hp, email')->where('role', 'pengawas')->orderBy('nama_lengkap', 'ASC')->get()->getResultArray();

SELECT *
FROM `bantuan_sekolah`
WHERE `id` = 14
SELECT *
FROM `foto_progres_pekerjaan`
WHERE `bantuan_sekolah_id` = 14
DELETE FROM `bantuan_sekolah`
WHERE `id` = 14
---
    public function deleteBantuan(int $assistanceId)
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Hanya admin yang dapat menghapus jenis bantuan.');
        }

        $db = Database::connect();
        $assistance = $db->table('bantuan_sekolah')->where('id', $assistanceId)->get()->getRowArray();
        if (!$assistance) {
            return redirect()->to('/admin/sekolah')->with('error', 'Jenis bantuan tidak ditemukan.');
        }
        $progressPhotos = $db->table('foto_progres_pekerjaan')
            ->where('bantuan_sekolah_id', $assistanceId)
            ->get()
            ->getResultArray();
        if (!$db->table('bantuan_sekolah')->where('id', $assistanceId)->delete()) {