app/Controllers/Pelaporan.php

SELECT *
FROM `sekolah`
WHERE `sekolah`.`id` = 1
---
    public function index($jenis = '50')
    {
        $userId = session()->get('id');
        $sekolahModel = new SekolahModel();
        $dokumenModel = new DokumenPelaporanModel();
        $progresModel = new ProgresMingguanModel();

        $sekolahList = $sekolahModel->getByPengawas($userId);
        if (empty($sekolahList)) {
            return redirect()->to('/dashboard')->with('error', 'Tidak ada sekolah kelolaan.');
        }

        $sekolahId = $sekolahList[0]['id'];
        $sekolah = $sekolahModel->find($sekolahId);