app/Controllers/Profil.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function index()
    {
        $userModel = new UserModel();
        $user = $userModel->find(session()->get('id'));