app/Controllers/TimP2SP.php

SELECT *
FROM `sekolah`
ORDER BY `nama_sekolah` ASC
---
    public function index()
    {
        $role = session()->get('role');
        if (!in_array($role, ['admin', 'perencana'], true)) {
            return redirect()->to('/dashboard')->with('error', 'Tim P2SP hanya dapat dikelola admin atau perencana.');
        }

        $schools = $role === 'admin'
            ? (new SekolahModel())->orderBy('nama_sekolah', 'ASC')->findAll()