app/Models/DokumenPelaporanModel.php

    public function getBySekolahJenis(int $sekolahId, string $jenis = '50%')
    {
        return $this->where('sekolah_id', $sekolahId)
                    ->where('jenis_pelaporan', $jenis)
                    ->orderBy('urutan', 'ASC')
                    ->findAll();
---
SELECT *
FROM `dokumen_pelaporan`
WHERE `sekolah_id` = 1
AND `jenis_pelaporan` = '50%'
ORDER BY `urutan` ASC