app/Models/ProgresMingguanModel.php

    public function getBySekolah(int $sekolahId)
    {
        return $this->where('sekolah_id', $sekolahId)
                    ->orderBy('minggu_ke', 'ASC')
                    ->findAll();
---
SELECT *
FROM `progres_mingguan`
WHERE `sekolah_id` = 1
ORDER BY `minggu_ke` ASC