app/Models/SekolahModel.php

SELECT *
FROM `sekolah`
WHERE `pengawas_id` = 1
---
    public function getByPengawas(int $pengawasId)
    {
        return $this->where('pengawas_id', $pengawasId)->findAll();