app/Models/TimP2SPModel.php

SELECT *
FROM `tim_p2sp`
WHERE `sekolah_id` = 1
---
    public function getBySekolah(int $schoolId): array
    {
        return $this->where('sekolah_id', $schoolId)->findAll();