app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'admin'
OR `username` = 'admin'
 LIMIT 1
---
    public function findByEmailOrUsername(string $login)
    {
        return $this->where('email', $login)
                    ->orWhere('username', $login)
                    ->first();